from django.shortcuts import render, redirect
from .models import Task
from .forms import TaskForm
import openai, os
from dotenv import load_dotenv
load_dotenv()


api_key = os.getenv("OPENAI_KEY", None)


def chatbot(request):
    chatbot_response = None
    if api_key is not None and request.method == 'POST':
        openai.api_key = api_key
        user_input = request.POST.get('user_input')
        prompt = f"Ти онлайн-консультант готелю Карпати. Ти володієш такою інформацією:" \
                 f"Біля готелю є багато джерел, водоспад Кам'янка та Журавлине озеро. Добратись до готелю можна з траси Київ–Чоп, від автобусної зупинки Дубина, далі повертаєте дорогою (за вказівником), проходите через залізниичну колію, міст на річці Опір та повертаєте наліво і там буде турбаза." \
                 f"У готелі є 6 типів номерів: Стандарт, Де-люкс, Сімейний, Люкс, Покращений люкс та Бізнес-номер." \
                 f"Стандарт - Це найбільш поширений тип номеру, що надає зручне та затишне помешкання з одним або двома ліжками. Невеликий одноміcний або двомісний номер, зі всіма необхідними зручностями, який ідеально підійде для невибагливих мандрівників. Користується особливою популярністю для відряджень. У ньому є двохспальне місце, LCD телевізор, холодильник, ванні аксесуари та безкоштовний Wi-FI. Ціна за ніч - 150 грн." \
                 f"Де-люкс - Це номер зі збільшеною площею та розкішним оформленням, що забезпечує комфортне перебування гостей. Невеликий, затишний та зручний номер з двоспальним ліжком, яке підійде як для двох осіб, так і для одного гостя. За приємну ціну ми пропонуємо зручне робоче місце з письмовим столом та комфортну зону відпочинку. У ньому є двохспальне місце, письмовий стіл з кріслом, LCD телевізор, холодильник, ванні аксесуари, ванний халат і тапочки та безкоштовний Wi-FI. Ціна за ніч - 200 грн." \
                 f"Сімейний - Це номер,який розрахований на розміщення більшої кількості людей, що складається з двох або більше кімнат. Просторий та зручний номер з двома двоспальними ліжками, який ідеально підійде для невеликої сім'ї з дітьми. За приємну ціну ми пропонуємо затишний номер для комфортного відпочинку. У ньому є 2 двохспальних місць, LCD телевізор, холодильник, ванні аксесуари та безкоштовний Wi-FI. Ціна за ніч - 300 грн." \
                 f"Люкс - Це номер зі збільшеною площею та розкішним оформленням, що забезпечує максимальний комфорт та розкіш. Затишний та просторий номер із вишуканим інтер'єром, що забезпечить комфортне проживання. Номер ідеально підходить для романтичної поїздки вдвох, дружньої поїздки чи відрядження. У ньому є двохспальне місце, письмовий стіл з кріслом, LCD телевізор, холодильник, кондиціонер, ванні аксесуари, ванний халат і тапочки та безкоштовний Wi-FI. Ціна за ніч - 250 грн." \
                 f"Покращений люкс - Це номер з ще більш розкішним оформленням, який має додаткові зручності, такі як окрему спальну та вітальню з каміном. Вишуканий та комфортний номер ідеально підійде для сім'ї з дітьми, оскільки в кімнаті є зона відпочинку із широким диваном. У ньому є 2 двохспальних місць, письмовий стіл з кріслом, LCD телевізор, холодильник, кондиціонер, ванні аксесуари, ванний халат і тапочки та безкоштовний Wi-FI. Ціна за ніч - 300 грн." \
                 f"Бізнес-номер - Це номер, який має додаткові робочі простори для бізнес-подорожуючих, наприклад, робочий стіл, безкоштовний Wi-Fi та міні конференц-зали. Це вишуканий двокімнатний номер з чудовою шумоізоляцією, виконаний у класичному стилі та світлих тонах із просторою зоною відпочинку та комфортною робочою зоною. У ньому є 2 двохспальних місць, письмовий стіл з кріслом, LCD телевізор, холодильник, кондиціонер, ванні аксесуари, ванний халат і тапочки та безкоштовний Wi-FI. Ціна за ніч - 400 грн." \
                 f"Відвідувач дає тобі запитання, якщо питання відвідувача буде відноситись до сфери готелю то" \
                 f"дай відповідь на його питання: {user_input}"

        response = openai.Completion.create(
            engine='text-davinci-003',
            prompt=prompt,
            max_tokens=256,
            temperature=0.5
        )
        print(response)

        chatbot_response = response["choices"][0]["text"]
    return render(request, 'main/qa.html', {"response": chatbot_response})


def index(request):
    return render(request, 'main/index.html')


def about(request):
    return render(request, 'main/about.html')


def about_standart(request):
    return render(request, 'main/about_standart.html')


def about_deluxe(request):
    return render(request, 'main/about_deluxe.html')


def about_family(request):
    return render(request, 'main/about_family.html')


def about_luxe(request):
    return render(request, 'main/about_luxe.html')


def about_proluxe(request):
    return render(request, 'main/about_proluxe.html')


def about_business(request):
    return render(request, 'main/about_business.html')


def services(request):
    return render(request, 'main/services.html')


def create(request):
    error = ''
    if request.method == 'POST':
        form = TaskForm(request.POST)
        if form.is_valid():
            form.save()
            return redirect('home')
        else:
            error = 'Форма неправильна'

    form = TaskForm()
    context = {
        'form': form,
        'error': error
    }
    return render(request, 'main/create.html', context)


def create_comment(request):
    tasks = Task.objects.order_by('-id')
    return render(request, 'main/create_comment.html', {'title': 'Коментарі', 'tasks': tasks})